[
    {
        "level": 0,
        "variants": [
            "Many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. (Daniel 12:2)",
            "Fear God, and keep his commandments: for this is the whole duty of man. (Ecclesiastes 12:13)",
            "Thus saith the LORD: \"Behold, all souls are mine; as the soul of the father, so also the soul of the son is mine: the soul that sinneth, it shall die.\" (Ezekiel 18:4)",
            "As I live, saith the Lord GOD, I have no pleasure in the death of the wicked; but that the wicked turn from his way and live: turn ye, turn ye from your evil ways; for why will ye die? (Ezekiel 33:11)",
            "As it is appointed unto men once to die, but after this the judgment: So Christ was once offered to bear the sins of many; and unto them that look for him shall he appear the second time without sin unto salvation. (Hebrews 9:27-28)",
            "Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter! (Isaiah 5:20)",
            "We are all as an unclean thing, and all our righteousnesses are as filthy rags; and we all do fade as a leaf; and our iniquities, like the wind, have taken us away. (Isaiah 64:6)",
            "The heart is deceitful above all things, and desperately wicked: who can know it? (Jeremiah 17:9)",
            "Thus saith the LORD: \"Turn ye even to me with all your heart, and with fasting, and with weeping, and with mourning: and rend your heart, and not your garments, and turn unto the LORD your God: for he is gracious and merciful, slow to anger, and of great kindness, and repenteth him of the evil.\" (Joel 2:12-13)",
            "Jesus said: \"Except ye repent, ye shall all likewise perish.\" (Luke 13:3)",
            "Jesus said: \"What shall it profit a man, if he shall gain the whole world, and lose his own soul?\" (Mark 8:36)",
            "Jesus said: \"Fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to destroy both soul and body in hell.\" (Matthew 10:28)",
            "What is a man profited, if he shall gain the whole world, and lose his own soul? or what shall a man give in exchange for his soul? (Matthew 16:26)",
            "Repent ye: for the kingdom of heaven is at hand. (Matthew 3:2)",
            "Jesus said: \"Repent: for the kingdom of heaven is at hand.\" (Matthew 4:17)",
            "There is a way which seemeth right unto a man, but the end thereof are the ways of death. (Proverbs 14:12)",
            "The fool hath said in his heart, There is no God. They are corrupt, they have done abominable works, there is none that doeth good. (Psalm 14:1)",
            "Whosoever was not found written in the book of life was cast into the lake of fire. (Revelation 20:15)",
            "The fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone: which is the second death. (Revelation 21:8)",
            "All have sinned, and come short of the glory of God. (Romans 3:23)",
            "Ye serpents, ye generation of vipers, how can ye escape the damnation of hell? (Matthew 23:33)"
        ]
    },
    {
        "level": 1,
        "variants": [
            "The Son of man is come to seek and to save that which was lost. (Luke 19:10)",
            "Jesus said: \"The time is fulfilled, and the kingdom of God is at hand: repent ye, and believe the gospel.\" (Mark 1:15)",
            "God... now commandeth all men every where to repent: because he hath appointed a day, in the which he will judge the world in righteousness by that man whom he hath ordained; whereof he hath given assurance unto all men, in that he hath raised him from the dead. (Acts 17:30-31)",
            "The Lord... is longsuffering to us-ward, not willing that any should perish, but that all should come to repentance. (2 Peter 3:9)",
            "Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him. (1 John 2:15)",
            "If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. (1 John 1:9)",
            "Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed. (1 Peter 2:24)",
            "Christ Jesus came into the world to save sinners. (1 Timothy 1:15)",
            "Behold, his soul which is lifted up is not upright in him: but the just shall live by his faith. (Habakkuk 2:4)",
            "Without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him. (Hebrews 11:6)",
            "Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool. (Isaiah 1:18)",
            "Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted. But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed. All we like sheep have gone astray; we have turned every one to his own way; and the LORD hath laid on him the iniquity of us all. (Isaiah 53:4-6)",
            "Seek ye the LORD while he may be found, call ye upon him while he is near. (Isaiah 55:6)",
            "Be ye doers of the word, and not hearers only, deceiving your own selves. (James 1:22)",
            "Jesus said: \"The thief cometh not, but for to steal, and to kill, and to destroy: I am come that they might have life, and that they might have it more abundantly.\" (John 10:10)",
            "Enter ye in at the strait gate: for wide is the gate, and broad is the way, that leadeth to destruction, and many there be which go in thereat: because strait is the gate, and narrow is the way, which leadeth unto life, and few there be that find it. (Matthew 7:13-14)",
            "He that covereth his sins shall not prosper: but whoso confesseth and forsaketh them shall have mercy. (Proverbs 28:13)",
            "God commendeth his love toward us, in that, while we were yet sinners, Christ died for us. (Romans 5:8)",
            "Thus saith the LORD of hosts; Turn ye unto me, saith the LORD of hosts, and I will turn unto you, saith the LORD of hosts. (Zechariah 1:3)",
            "We know that God heareth not sinners: but if any man be a worshipper of God, and doeth his will, him he heareth. (John 9:31)"
        ]
    },
    {
        "level": 2,
        "variants": [
            "He that loveth not knoweth not God; for God is love. (1 John 4:8)",
            "He that hath the Son hath life; and he that hath not the Son of God hath not life. (1 John 5:12)",
            "All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness: That the man of God may be perfect, throughly furnished unto all good works. (2 Timothy 3:16-17)",
            "Christ died for our sins according to the scriptures; and that he was buried, and that he rose again the third day according to the scriptures. (1 Corinthians 15:3-4)",
            "There is one God, and one mediator between God and men, the man Christ Jesus. (1 Timothy 2:5)",
            "He hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him. (2 Corinthians 5:21)",
            "Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost. (Acts 2:38)",
            "Neither is there salvation in any other: for there is none other name under heaven given among men, whereby we must be saved. (Acts 4:12)",
            "Set your affection on things above, not on things on the earth. (Colossians 3:2)",
            "By grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast. (Ephesians 2:8-9)",
            "The fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith, meekness, temperance: against such there is no law. (Galatians 5:22-23)",
            "Jesus said: \"If the Son therefore shall make you free, ye shall be free indeed.\" (John 8:36)",
            "Thus saith the LORD: \"Unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall.\" (Malachi 4:2)",
            "Jesus said, \"Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind.\" (Matthew 22:37)",
            "He hath shewed thee, O man, what is good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God? (Micah 6:8)",
            "God also hath highly exalted him, and given him a name which is above every name: That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth; and that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. (Philippians 2:9-11)",
            "Trust in the LORD with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths. (Proverbs 3:5-6)",
            "Thy word is a lamp unto my feet, and a light unto my path. (Psalm 119:105)",
            "The wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord. (Romans 6:23)"
        ]
    },
    {
        "level": 3,
        "variants": [
            "I am crucified with Christ: nevertheless I live; yet not I, but Christ liveth in me: and the life which I now live in the flesh I live by the faith of the Son of God, who loved me, and gave himself for me. (Galatians 2:20)",
            "As many as received him, to them gave he power to become the sons of God, even to them that believe on his name: which were born, not of blood, nor of the will of the flesh, nor of the will of man, but of God. (John 1:12-13)",
            "Jesus said: \"I am the way, the truth, and the life: no man cometh unto the Father, but by me.\" (John 14:6)",
            "For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. For God sent not his Son into the world to condemn the world; but that the world through him might be saved. (John 3:16-17)",
            "Jesus said: \"Except a man be born again, he cannot see the kingdom of God.\" (John 3:3)",
            "Jesus said: \"He that heareth my word, and believeth on him that sent me, hath everlasting life, and shall not come into condemnation; but is passed from death unto life.\" (John 5:24)",
            "Jesus said: \"He that believeth and is baptized shall be saved; but he that believeth not shall be damned.\" (Mark 16:16)",
            "And the Spirit and the bride say, Come. And let him that heareth say, Come. And let him that is athirst come. And whosoever will, let him take the water of life freely. (Revelation 22:17)",
            "Jesus said: \"Behold, I stand at the door, and knock: if any man hear my voice, and open the door, I will come in to him, and will sup with him, and he with me.\" (Revelation 3:20)",
            "Whosoever shall call upon the name of the Lord shall be saved. (Romans 10:13)",
            "The word is nigh thee, even in thy mouth, and in thy heart: that is, the word of faith, which we preach; that if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved. (Romans 10:8-9)",
            "With the heart man believeth unto righteousness; and with the mouth confession is made unto salvation. For the scripture saith, Whosoever believeth on him shall not be ashamed. (Romans 10:10-11)",
            "Whosoever shall call upon the name of the Lord shall be saved. (Romans 10:13)",
            "The grace of God that bringeth salvation hath appeared to all men, teaching us that, denying ungodliness and worldly lusts, we should live soberly, righteously, and godly, in this present world; looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ; who gave himself for us, that he might redeem us from all iniquity, and purify unto himself a peculiar people, zealous of good works. (Titus 2:11-14)",
            "Jesus said, \"Come unto me, all ye that labour and are heavy laden, and I will give you rest. Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls. For my yoke is easy, and my burden is light.\" (Matthew 11:28-30)"
        ]
    }
]