[
    {
      "name": "gff",
      "index": "1_concept_1",
      "entry": "Concept: The Good Fight of Faith",
      "title": "The Good Fight of Faith",
      "type": "concept",
      "text": "\"Fight the good fight of faith, lay hold on eternal life, whereunto thou art also called, and hast professed a good profession before many witnesses.\" (1 Timothy 6:12)",
      "image": "gff_logo_128",
      "inspiration": "\"The Good Fight of Faith\" (or GFF) is a Christian, Bible-based computer game where the player takes the role of a new believer, guiding him through an allegorical world to learn about the holy scriptures, the Christian life, and the reality of spiritual warfare. The game is designed to be fun and engaging, while also teaching important spiritual truths directly from the Bible."
    },
    {
      "name": "adam",
      "index": "1_concept_2",
      "entry": "Concept: Adam Cesar",
      "title": "Adam Cesar",
      "type": "concept",
      "text": "Adam is the main character of 'The Good Fight of Faith'. You will guide him on adventures throughout the Land of Allegoria, warring against the powers of darkness and liberating precious souls from their grasp.",
      "image": "adam_head",
      "inspiration": "Adam Cesar has been my best friend and brother in Christ since 2007. When I began to work on the game, I needed a main character, and he was the first person I thought of. But I like that his name is Adam, because he represents the everyman - anyone from Adam's race who is redeemed to become a new creature in Jesus Christ. Adam is not only a good friend to me, but a faithful servant and minister of Jesus Christ."
    },
    {
      "name": "faith",
      "index": "1_concept_3",
      "entry": "Concept: Faith",
      "title": "Faith",
      "type": "concept",
      "text": "Now faith is the substance of things hoped for, the evidence of things not seen. (...) By faith, Noah, being warned of God of things not seen as yet, moved with fear, prepared an ark to the saving of his house; by the which he condemned the world, and became heir of the righteousness which is by faith.\" (Hebrews 11:1, 7)",
      "image": "faith_entry",
      "inspiration": "Faith is one of the central themes of Christianity. Faith is believing in what is not seen, on the basis of what is revealed; it is the only way for us to have a relationship with the invisible God, who reveals himself by his Word. (1 Sam. 3:21; Col. 1:15; John 1:1-18) It is through faith that Christ dwells in our hearts (Eph. 3:17); it is the way of God's righteousness (Rom. 1:17; 10:10; Phil. 3:9); and it is the means by which we have access into God's grace (Rom. 5:1-2), the only thing that can save us (Eph. 2:8)."
    },
    {
      "name": "grace",
      "index": "1_concept_4",
      "entry": "Concept: Grace",
      "title": "Grace",
      "type": "concept",
      "text": "\"And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me.\" (2 Corinthians 12:9)",
      "image": "grace_entry",
      "inspiration": "God's grace is his favor, kindness, and goodwill toward man, and specially toward those who are righteous before him (Gen. 6:8-9; 7:1). It is God being \"for us\" (Rom. 8:31), shewing himself strong on our behalf (2 Chron. 16:9). The scripture says that God's grace is accessed by faith (Rom. 5:2); that we must grow in it (2 Pet. 3:18); and that he gives grace to those who walk in humility and uprightness (Mic. 6:8; Jas. 4:6; Ps. 84:11). There is no greater power, or more precious gift, than the true grace of God in Jesus Christ."
    },
    {
      "name": "treasure_chest",
      "index": "1_concept_5",
      "entry": "Concept: Treasure Chest",
      "title": "Treasure Chest",
      "type": "concept",
      "text": "\"That their hearts might be comforted, being knit together in love, and unto all riches of the full assurance of understanding, to the acknowledgement of the mystery of God, and of the Father, and of Christ; In whom are hid all the treasures of wisdom and knowledge.\" (Colossians 2:2-3)",
      "image": "chest_entry",
      "inspiration": "Throughout the Land of Allegoria, Adam will find treasure chests containing valuable items and bonuses. These treasures represent spiritual riches that a Christian can discover and grow into in Christ: receiving daily bread, keeping his commandments, understanding of the scriptures, and equipping the whole armour of God (Prov. 8:20-21; Is. 33:6; Matt. 6:19-21)."
    },
    {
      "name": "church",
      "index": "1_concept_6",
      "entry": "Concept: Church",
      "title": "Church",
      "type": "concept",
      "text": "\"And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart, praising God, and having favour with all the people. And the Lord added to the church daily such as should be saved.\" (Acts 2:46-47)",
      "image": "church_entry",
      "inspiration": "The church of God is his greatest work upon this earth: men redeemed from sin and the powers of darkness (Isa. 44:22; Acts 26:18), renewed in Christ by the power of the Holy Ghost (Col. 3:10; Tit. 3:5-7), and builded together into an holy temple for God to dwell in (Eph. 2:19-22; 4:1-16). With Christ as the head (Eph. 1:22; 5:23; Col. 1:18), the church is called to be his body, carrying on the ministry of reconciliation upon the earth in his stead (2 Cor. 5:18-20)."
    },
    {
      "name": "town",
      "index": "1_concept_7",
      "entry": "Concept: Town",
      "title": "Town",
      "type": "concept",
      "text": "\"And he said unto them, Let us go into the next towns, that I may preach there also: for therefore came I forth.\" (Mark 1:38)",
      "image": "town_entry",
      "inspiration": "There are 10 towns in the Land of Allegoria, each a bustling community of precious souls who have a need for the light of God's word and the gospel of Christ. In each town, you will also find an assembly of believers (church), and a Spirit Travel location, which can be used to quick-travel to other towns."
    },
    {
      "name": "spirit_travel",
      "index": "1_concept_8",
      "entry": "Concept: Spirit Travel",
      "title": "Spirit Travel",
      "type": "concept",
      "text": "\"And when they were come up out of the water, the Spirit of the Lord caught away Philip, that the eunuch saw him no more: and he went on his way rejoicing. But Philip was found at Azotus: and passing through he preached in all the cities, till he came to Caesarea.\" (Acts 8:39-40)",
      "image": "agency_entry",
      "inspiration": "'Spirit Travel' is a fictional organization that doubles as both a travel agency and an airline. Inspired by 1 Kings 18:12 and Acts 8:39, in which the Spirit of the Lord carries Elijah and Philip to distant places, Spirit Travel allows Adam to quickly travel between towns using an unlimited travel pass item. (NOTE: Spirit Travel is not affiliated with or representative of Spirit Airlines®, a real-world airline company.)"
    },
    {
      "name": "prophet",
      "index": "1_concept_9",
      "entry": "Concept: Prophet",
      "title": "Prophet",
      "type": "concept",
      "text": "\"Then Jeremiah the prophet said unto them, I have heard you; behold, I will pray unto the LORD your God according to your words; and it shall come to pass, that whatsoever thing the LORD shall answer you, I will declare it unto you; I will keep nothing back from you.\" (Jeremiah 42:4)",
      "image": "prophet_entry",
      "inspiration": "Prophets are holy men of God who speak his word as they are moved by the Holy Ghost (2 Pet. 1:21). They are sent by God to deliver messages of warning, instruction, and encouragement to his people (Deut. 34:10-12; 1 Sam. 3:19-21; Jer. 7:25; Amos 3:7). In GFF, prophets are important allies who will give Adam guidance and strengthen him to face the challenges ahead."
    },
    {
      "name": "captive",
      "index": "1_concept_10",
      "entry": "Concept: Captive",
      "title": "Captive",
      "type": "concept",
      "text": "\"The Spirit of the Lord GOD is upon me; because the LORD hath anointed me to preach good tidings unto the meek; he hath sent me to bind up the brokenhearted, to proclaim liberty to the captives, and the opening of the prison to them that are bound;\" (Isaiah 61:1)",
      "image": "captive_entry",
      "inspiration": "Captives represent precious souls who are held in bondage by the enemy, bound fast by sins, addictions, false doctrines, or other infirmity. Held deep within enemy strongholds, they cry out to God for deliverance; and he raises up faithful servants to storm the gates of hell, war against the powers of darkness, and set the captives free by the Spirit of Christ (Ps. 107:10-16; Isa. 49:7-9)."
    },
    {
      "name": "enemies",
      "index": "1_concept_11",
      "entry": "Concept: Enemies",
      "title": "Enemies",
      "type": "concept",
      "text": "\"And there was war in heaven: Michael and his angels fought against the dragon; and the dragon fought and his angels,\" (Revelation 12:7) \"For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.\" (Ephesians 6:12)",
      "image": "enemies_entry",
      "inspiration": "Satan and his devils are the spiritual enemies of God and his children. They seek to deceive, tempt, and destroy precious souls; to hinder the work of God's Spirit and the advancement of his kingdom (John 10:10; Acts 26:18; Col. 1:13; 1 Pet. 5:8). As a soldier of Christ, Adam must stand firm against these wicked spirits, wielding the sword of the Spirit, resisting them by the power of God until they flee (Eph. 6:10-18; Jas. 4:7)."
    },
    {
      "name": "trap",
      "index": "1_concept_12",
      "entry": "Concept: Trap",
      "title": "Trap",
      "type": "concept",
      "text": "\"For among my people are found wicked men: they lay wait, as he that setteth snares; they set a trap, they catch men.\" (Jeremiah 5:26)",
      "image": "trap_entry",
      "inspiration": "Within strongholds, Adam may sometimes encounter traps set by the enemy. These represent the various temptations, idols, and vices which men may fall into, diverting them from the path of righteousness (Ex. 23:33; 1 Tim. 3:7; Heb. 12:1). If Adam should stumble into a trap, his faith will be damaged and he will be stunned for a moment, making him an easy target for enemies. See then that ye walk circumspectly, not as fools, but as wise."
    },
    {
      "name": "stronghold",
      "index": "1_concept_13",
      "entry": "Concept: Stronghold",
      "title": "Stronghold",
      "type": "concept",
      "text": "\"For though we walk in the flesh, we do not war after the flesh: (For the weapons of our warfare are not carnal, but mighty through God to the pulling down of strong holds;) Casting down imaginations, and every high thing that exalteth itself against the knowledge of God, and bringing into captivity every thought to the obedience of Christ; And having in a readiness to revenge all disobedience, when your obedience is fulfilled.\" (2 Corinthians 10:3-6)",
      "image": "stronghold_entry",
      "inspiration": "Strongholds represent fortified positions of the enemy, where devils and spirits hold out against the advance of God's kingdom and power. They are evil places, filled with traps, enemies, and dangers; but it is the duty of every Christian soldier to assault these bastions of spiritual wickedness in the name of the Lord, to loose those who are bound therein, and to claim victory over the powers of darkness through our Lord Jesus Christ (2 Sam. 5:6-7; Psalm 18; 1 Cor. 15:57; 1 John 3:8)."
    },
    {
      "name": "pray",
      "index": "2_ability_1",
      "entry": "Ability: Pray",
      "title": "Pray",
      "type": "concept",
      "text": "\"Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God.\" (Philippians 4:6)",
      "image": "pray_entry",
      "inspiration": "Praying is a vital aspect of our two-way relationship with God. It is through prayer that we talk to our Father, expressing our worship, needs, desires, concerns, and thanks; and we have confidence that he hears us, cares for us, and answers for our good according to his will. (1 John 5:14-15.) In GFF, Adam can use the 'Pray' ability to find grace in time of need, building up his most holy faith as he prays in the Holy Ghost (Heb. 4:16; Jude 1:20)."
    },
    {
      "name": "armor_6",
      "index": "3_armor_1",
      "entry": "Armour 1: Girdle of Truth",
      "title": "Girdle of Truth",
      "type": "item",
      "text": "\"For I rejoiced greatly, when the brethren came and testified of the truth that is in thee, even as thou walkest in the truth.\" (3 John 1:3)",
      "image": "arm6",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "armor_4",
      "index": "3_armor_2",
      "entry": "Armour 2: Breastplate of Righteousness",
      "title": "Breastplate of Righteousness",
      "type": "item",
      "text": "\"Hearken unto me, ye that know righteousness, the people in whose heart is my law; fear ye not the reproach of men, neither be ye afraid of their revilings.\" (Isaiah 51:7)",
      "image": "arm4",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "armor_5",
      "index": "3_armor_3",
      "entry": "Armour 3: Shoes of the Gospel of Peace",
      "title": "Shoes of the Gospel of Peace",
      "type": "item",
      "text": "\"How beautiful are the feet of them that preach the gospel of peace, and bring glad tidings of good things!\" (Romans 10:15b)",
      "image": "arm5",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "armor_3",
      "index": "3_armor_4",
      "entry": "Armour 4: Shield of Faith",
      "title": "Shield of Faith",
      "type": "item",
      "text": "\"Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked.\" (Ephesians 6:16)",
      "image": "arm3",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "armor_2",
      "index": "3_armor_5",
      "entry": "Armour 5: Helmet of Salvation",
      "title": "Helmet of Salvation",
      "type": "item",
      "text": "\"O GOD the Lord, the strength of my salvation, thou hast covered my head in the day of battle.\" (Psalm 140:7)",
      "image": "arm2",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "armor_1",
      "index": "3_armor_6",
      "entry": "Armour 6: Sword of the Spirit",
      "title": "Sword of the Spirit",
      "type": "item",
      "text": "\"For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.\" (Hebrews 4:12)",
      "image": "arm1",
      "inspiration": "In Ephesians 6:10, Paul says, \"Put on the whole armour of God, that ye may be able to stand against the wiles of the devil.\" Each piece of this armour will help protect the Christian soldier against the attacks of the enemy."
    },
    {
      "name": "cmd_1",
      "index": "4_cmd_1",
      "entry": "Commandment 1: Thou shalt have no other gods",
      "title": "1st Commandment",
      "type": "item",
      "text": "\"I am the LORD thy God, which have brought thee out of the land of Egypt, out of the house of bondage. Thou shalt have no other gods before me.\" (Exodus 20:2-3)",
      "image": "cmd1",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_2",
      "index": "4_cmd_2",
      "entry": "Commandment 2: Thou shalt not make graven images",
      "title": "2nd Commandment",
      "type": "item",
      "text": "\"Thou shalt not make unto thee any graven image... Thou shalt not bow down thyself to them, nor serve them...\" (Exodus 20:4-5)",
      "image": "cmd2",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_3",
      "index": "4_cmd_3",
      "entry": "Commandment 3: Thou shalt not take God's name in vain",
      "title": "3rd Commandment",
      "type": "item",
      "text": "\"Thou shalt not take the name of the LORD thy God in vain; for the LORD will not hold him guiltless that taketh his name in vain.\" (Exodus 20:7)",
      "image": "cmd3",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_4",
      "index": "4_cmd_4",
      "entry": "Commandment 4: Remember the sabbath",
      "title": "4th Commandment",
      "type": "item",
      "text": "\"Remember the sabbath day, to keep it holy. Six days shalt thou labour, and do all thy work: But the seventh day is the sabbath of the LORD thy God...\" (Exodus 20:8-10)",
      "image": "cmd4",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_5",
      "index": "4_cmd_5",
      "entry": "Commandment 5: Honour thy father and mother",
      "title": "5th Commandment",
      "type": "item",
      "text": "\"Honour thy father and thy mother: that thy days may be long upon the land which the LORD thy God giveth thee.\" (Exodus 20:12)",
      "image": "cmd5",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_6",
      "index": "4_cmd_6",
      "entry": "Commandment 6: Thou shalt not kill",
      "title": "6th Commandment",
      "type": "item",
      "text": "\"Thou shalt not kill.\" (Exodus 20:13)",
      "image": "cmd6",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_7",
      "index": "4_cmd_7",
      "entry": "Commandment 7: Thou shalt not commit adultery",
      "title": "7th Commandment",
      "type": "item",
      "text": "\"Thou shalt not commit adultery.\" (Exodus 20:14)",
      "image": "cmd7",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_8",
      "index": "4_cmd_8",
      "entry": "Commandment 8: Thou shalt not steal",
      "title": "8th Commandment",
      "type": "item",
      "text": "\"Thou shalt not steal.\" (Exodus 20:15)",
      "image": "cmd8",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_9",
      "index": "4_cmd_9",
      "entry": "Commandment 9: Thou shalt not bear false witness",
      "title": "9th Commandment",
      "type": "item",
      "text": "\"Thou shalt not bear false witness against thy neighbour.\" (Exodus 20:16)",
      "image": "cmd9",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "cmd_10",
      "index": "4_cmd_10",
      "entry": "Commandment 10: Thou shalt not covet",
      "title": "10th Commandment",
      "type": "item",
      "text": "\"Thou shalt not covet thy neighbour's house... nor any thing that is thy neighbour's.\" (Exodus 20:17)",
      "image": "cmd10",
      "inspiration": "Proverbs 6:23 says, \"For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life\". Each commandment found will brighten your path, allowing you to see farther in the wilderness of this world."
    },
    {
      "name": "fruit_1",
      "index": "5_fruit_1",
      "entry": "Fruit 1: Love",
      "title": "Fruit of the Spirit: Love",
      "type": "item",
      "text": "\"By this shall all men know that ye are my disciples, if ye have love one to another.\" (John 13:35)",
      "image": "fruit1",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_2",
      "index": "5_fruit_2",
      "entry": "Fruit 2: Joy",
      "title": "Fruit of the Spirit: Joy",
      "type": "item",
      "text": "\"Whom having not seen, ye love; in whom, though ye see him not, yet believing, ye rejoice with joy unspeakable and full of glory:\" (1 Peter 1:8)",
      "image": "fruit2",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_3",
      "index": "5_fruit_3",
      "entry": "Fruit 3: Peace",
      "title": "Fruit of the Spirit: Peace",
      "type": "item",
      "text": "\"Peace I leave with you, my peace I give unto you: not as the world giveth, give I unto you. Let not your heart be troubled, neither let it be afraid.\" (John 14:27)",
      "image": "fruit3",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_4",
      "index": "5_fruit_4",
      "entry": "Fruit 4: Longsuffering",
      "title": "Fruit of the Spirit: Longsuffering",
      "type": "item",
      "text": "\"Strengthened with all might, according to his glorious power, unto all patience and longsuffering with joyfulness;\" (Colossians 1:11)",
      "image": "fruit4",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_5",
      "index": "5_fruit_5",
      "entry": "Fruit 5: Gentleness",
      "title": "Fruit of the Spirit: Gentleness",
      "type": "item",
      "text": "\"And the servant of the Lord must not strive; but be gentle unto all men, apt to teach, patient,\" (2 Timothy 2:24)",
      "image": "fruit5",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_6",
      "index": "5_fruit_6",
      "entry": "Fruit 6: Goodness",
      "title": "Fruit of the Spirit: Goodness",
      "type": "item",
      "text": "\"And I myself also am persuaded of you, my brethren, that ye also are full of goodness, filled with all knowledge, able also to admonish one another.\" (Romans 15:14)",
      "image": "fruit6",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_7",
      "index": "5_fruit_7",
      "entry": "Fruit 7: Faith",
      "title": "Fruit of the Spirit: Faith",
      "type": "item",
      "text": "\"But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him.\" (Hebrews 11:6)",
      "image": "fruit7",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_8",
      "index": "5_fruit_8",
      "entry": "Fruit 8: Meekness",
      "title": "Fruit of the Spirit: Meekness",
      "type": "item",
      "text": "\"Take my yoke upon you, and learn of me; for I am meek and lowly in heart: and ye shall find rest unto your souls.\" (Matthew 11:29)",
      "image": "fruit8",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "fruit_9",
      "index": "5_fruit_9",
      "entry": "Fruit 9: Temperance",
      "title": "Fruit of the Spirit: Temperance",
      "type": "item",
      "text": "\"And every man that striveth for the mastery is temperate in all things. Now they do it to obtain a corruptible crown; but we an incorruptible.\" (1 Corinthians 9:25)",
      "image": "fruit9",
      "inspiration": "James 3:18 says, \"And the fruit of righteousness is sown in peace of them that make peace.\" Each fruit the Spirit has brought forth in you will make you a more effective minister of the gospel of peace, beseeching men to be reconciled to God."
    },
    {
      "name": "travel_pass",
      "index": "6_item_1",
      "entry": "Item: Travel Pass",
      "title": "Travel Pass",
      "type": "item",
      "text": "\"And pray ye that your flight be not in the winter.\" (Mark 13:18)",
      "image": "travel_pass",
      "inspiration": "In GFF, the Travel Pass is a special item that allows Adam to travel quickly between different towns. This is one of the few things in the game that is not derived from scripture; but in our modern world, flying by plane is an efficient way to travel long distances, so that we can go into all the world and preach the gospel to every creature (Mark 16:15)."
    },
    {
      "name": "seed",
      "index": "6_item_2",
      "entry": "Item: Seed",
      "title": "Seed",
      "type": "item",
      "text": "\"He that goeth forth and weepeth, bearing precious seed, shall doubtless come again with rejoicing, bringing his sheaves with him.\" (Psalm 126:6)",
      "image": "seed",
      "inspiration": "The Bible often speaks of the word of God as a seed; for example, in Isaiah 55:10-11, Luke 8:11, and 1 Peter 1:23. The seed of God's word must be sown into men's hearts to bring forth the new birth and its resultant fruit."
    },
    {
      "name": "sermon",
      "index": "6_item_3",
      "entry": "Item: Sermon",
      "title": "Sermon",
      "type": "item",
      "text": "\"Cry aloud, spare not, lift up thy voice like a trumpet, and shew my people their transgression, and the house of Jacob their sins.\" (Isaiah 58:1)",
      "image": "sermon",
      "inspiration": "As preachers of the gospel, we sometimes cry aloud with our voice like a trumpet, proclaiming a message to many people at once. In modern times, a bullhorn is particularly effective."
    },
    {
      "name": "standard",
      "index": "6_item_4",
      "entry": "Item: Standard",
      "title": "Standard",
      "type": "item",
      "text": "\"So shall they fear the name of the LORD from the west, and his glory from the rising of the sun. When the enemy shall come in like a flood, the Spirit of the LORD shall lift up a standard against him.\" (Isaiah 59:19)",
      "image": "standard_flag",
      "inspiration": "We lift up the Lord Jesus and pray that the Father would draw all men unto him (John 6:44; 12:32). Adam can lift up a standard to proclaim the authority of Christ and victory over the enemy, effectively conquering ground for the kingdom of God. Enemies are permenantly banished from all areas where a standard is raised."
    },
    {
      "name": "key",
      "index": "6_item_5",
      "entry": "Item: Key Verse",
      "title": "Key Verse",
      "type": "item",
      "text": "\"Woe unto you, lawyers! for ye have taken away the key of knowledge: ye entered not in yourselves, and them that were entering in ye hindered.\" (Luke 11:52)",
      "image": "key",
      "inspiration": "Key Verses are well-known passages that are vital to our understanding of the scripture and the will of God. In GFF, they are used as literal keys to open locked doors and other locks. (The graphic contains the 'Star of David' to represent the Key of David, which Jesus possesses in Revelation 3:7.)"
    },
    {
      "name": "milk",
      "index": "7_consum_1",
      "entry": "Consumable: Milk",
      "title": "Milk",
      "type": "item",
      "text": "\"As newborn babes, desire the sincere milk of the word, that ye may grow thereby:\" (1 Peter 2:2)",
      "image": "milk",
      "inspiration": "Hebrews 5:12 describes the \"first principles of the oracles of God\" as \"milk\". 1 Peter 2:2 tells us that this \"sincere milk of the word\" is important for the growth of newborn babes in Christ."
    },
    {
      "name": "meat",
      "index": "7_consum_2",
      "entry": "Consumable: Meat",
      "title": "Meat",
      "type": "item",
      "text": "\"Jesus saith unto them, My meat is to do the will of him that sent me, and to finish his work.\" (John 4:34)",
      "image": "meat",
      "inspiration": "Moving beyond the \"first principles\" of milk, Jesus teaches us in John 4:34 that the real diet of a Christian consists in doing the Father's will."
    },
    {
      "name": "strong_meat",
      "index": "7_consum_3",
      "entry": "Consumable: Strong Meat",
      "title": "Strong Meat",
      "type": "item",
      "text": "\"But strong meat belongeth to them that are of full age, even those who by reason of use have their senses exercised to discern both good and evil.\" (Hebrews 5:14)",
      "image": "strong_meat",
      "inspiration": "In Hebrews 5, Paul speaks of the perfection of Christ by the things which he suffered as \"strong meat\", reserved for those of \"full age\" who have grown to the measure of the stature of the fulness of Christ. (Ephesians 4:13)"
    },
    {
      "name": "exp_bonus",
      "index": "7_consum_4",
      "entry": "Consumable: Experience Bonus",
      "title": "Experience",
      "type": "item",
      "text": "\"And not only so, but we glory in tribulations also: knowing that tribulation worketh patience; and patience, experience; and experience, hope:\" (Romans 5:3-4)",
      "image": "xp_medal",
      "inspiration": "Experience plays a critical role in the Christian's spiritual growth. As you gain experience, you will level up, increasing your faith and making you stronger in Christ."
    },
    {
      "name": "wicked_treasure",
      "index": "7_consum_5",
      "entry": "Consumable: Treasure of Wickedness",
      "title": "Treasure of Wickedness",
      "type": "item",
      "text": "\"Are there yet the treasures of wickedness in the house of the wicked, and the scant measure that is abominable? Treasures of wickedness profit nothing: but righteousness delivereth from death.\" (Micah 6:10; Proverbs 10:2)",
      "image": "wicked_treasure",
      "inspiration": "Treasures of wickedness may sometimes look appealing, but their only eternal reward is the wrath of God (Romans 2:3-9). \"But thou, O man of God, flee these things; and follow after righteousness, godliness, faith, love, patience, meekness.\" (1 Timothy 6:11)"
    }
]